[
  {
    "id": "parkpie-landing",
    "title": "ParkPie Landing Website",
    "summary": "Architected a high-performance marketing platform using Next.js 16 and React 19, achieving a 100% Lighthouse performance score via zero-layout-shift font loading, edge-cached content, and semantic HTML.",
    "highlights": [
      "Engineered a cost-effective 'Headless CMS' solution using Airtable and Incremental Static Regeneration (ISR).",
      "Secured public infrastructure with a defence-in-depth strategy (Fixed-window rate limiting, Honeypot, Zod schemas).",
      "Mitigated critical React2Shell exposure (CVE-2025-55182) via zero-downtime upgrade.",
      "Orchestrated automated SEO pipelines generating dynamic sitemaps, RSS feeds, and Open Graph metadata."
    ],
    "stack": [
      "TypeScript",
      "Next.js 16",
      "React 19",
      "Tailwind CSS",
      "Vitest"
    ],
    "liveUrl": "https://parkpie-landing.vercel.app"
  },
  {
    "id": "cheap-guide",
    "title": "Cheap.Guide App Backend",
    "summary": "Served as Principal Backend Engineer & Solution Architect delivering a Spring Boot backend with REST APIs for auth, posts, geospatial search, AI moderation, and notifications.",
    "highlights": [
      "Integrated Firebase Auth (JWT) with role-based access control across 30+ endpoints.",
      "Replaced Redis with Caffeine in-memory caching, saving ~$400/year while achieving sub-millisecond retrieval.",
      "Set up async workflows with Google Pub/Sub handling 16 concurrent threads.",
      "Provisioned GCP infrastructure via Terraform and established CI/CD with GitHub Actions and multi-stage Docker builds."
    ],
    "stack": [
      "Java",
      "Spring Boot",
      "MySQL",
      "Terraform",
      "GCP",
      "Docker"
    ],
    "liveUrl": "https://www.cheap.guide"
  },
  {
    "id": "parkpie-app",
    "title": "ParkPie App Backend",
    "summary": "Led backend and AI development for a geospatial-first Django + PostGIS backend with optimised spatial queries.",
    "highlights": [
      "Pioneered an agentic AI pipeline with LangGraph and LangChain for multi-step reasoning (hybrid cloud/local inference).",
      "Deployed a scalable vector database with pgvector in PostgreSQL 17 to power semantic RAG search.",
      "Configured CI/CD with Docker Compose and GitHub Actions, enforcing TDD, mypy, and ruff.",
      "Added observability with LangSmith and OpenTelemetry + LGTM stack to monitor agent workflows."
    ],
    "stack": [
      "Python",
      "Django",
      "PostgreSQL",
      "LangChain",
      "Docker",
      "AWS"
    ],
    "repoUrl": "https://github.com/parkpie-app"
  },
  {
    "id": "social-media-analytics",
    "title": "Social Media Analytics System",
    "summary": "Spearheaded a team to deliver a cloud-native analytics system for the Australian federal election, coordinating sprint planning and cross-module integration.",
    "highlights": [
      "Developed a scalable Reddit harvester with Fission, ingesting and normalising 168k+ posts in real-time.",
      "Built a comment-tree collector enriching sentiment analysis, exposed via an Elasticsearch REST API.",
      "Created interactive Jupyter Notebook visualisations for filtering and trend analysis."
    ],
    "stack": [
      "Python",
      "Flask",
      "Kubernetes",
      "Elasticsearch",
      "Redis"
    ],
    "liveUrl": "https://www.youtube.com/watch?v=gWLpV47mN3w"
  }
]